Update Solution architecture.md
